{"total":2,"pageSize":10,"pageCount":1,"data":[{"title":"Hello Meta Space","slug":"hello-meta-space","date":"2021-12-22T12:54:08.040Z","updated":"2021-12-22T12:54:08.040Z","comments":true,"path":"api/articles/hello-meta-space.json","excerpt":null,"keywords":["Meta","MetaWorld"],"cover":"https://ipfs.fleek.co/ipfs/QmQxQ2jNCjBVebYd94yoxVd9mKd5aUPLd1LGEFn9MgS4kk","content":"<p>Welcome to Meta Space!</p>\n<h2 id=\"Quick-Start\">Quick Start</h2>\n<p>WIP</p>\n<h3 id=\"IPFS-image-sample\">IPFS image sample</h3>\n<figure class=\"highlight markdown\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">![<span class=\"string\">Preview</span>](<span class=\"link\">ipfs://QmQxQ2jNCjBVebYd94yoxVd9mKd5aUPLd1LGEFn9MgS4kk</span>)</span><br></pre></td></tr></table></figure>\n<p><img src=\"https://ipfs.fleek.co/ipfs/QmQxQ2jNCjBVebYd94yoxVd9mKd5aUPLd1LGEFn9MgS4kk\" alt=\"Preview\"></p>\n","raw":null,"categories":[{"name":"Generated","path":"api/categories/Generated.json"}],"tags":[{"name":"Meta Space","path":"api/tags/Meta Space.json"}]},{"title":"How to create content on Meta Space 如何在 Meta Space 上创建内容","slug":"How-to-create-content-on-Meta-Space-如何在-Meta-Space-上创建内容","date":"2021-12-22T04:41:02.000Z","updated":"2021-12-22T04:50:03.158Z","comments":true,"path":"api/articles/How-to-create-content-on-Meta-Space-如何在-Meta-Space-上创建内容.json","excerpt":"Meta Network -> Meta CMS -> Meta Space如果您需要为自己的 Meta Space 创建去中心化发布的文章，首先请完成个人 Meta Space 的创建。目前...","keywords":["Meta","MetaWorld"],"cover":"https://storageapi.fleek.co/andoroyur-team-bucket/metanetwork/users/metaio-storage/wei-xin-tu-pian-20210416005950.png","content":"<p><strong>Meta Network -&gt; Meta CMS -&gt; Meta Space</strong></p>\n<p><strong>如果您需要为自己的 Meta Space 创建去中心化发布的文章，首先请完成个人 Meta Space 的创建。目前该产品尚未适配 移动端 界面，请使用桌面浏览器访问使用。</strong><br>\n<strong>If you need to create decentralized posts for your Meta Space, please first create your own Meta Space. The product is not yet available for mobile, so please use your desktop browser to access it.</strong></p>\n<p><strong>访问地址：</strong><a href=\"https://www.meta-space-console.metanetwork.online\">https://www.meta-space-console.metanetwork.online</a><br>\n**Visit: **<a href=\"https://www.meta-space-console.metanetwork.online\">https://www.meta-space-console.metanetwork.online</a></p>\n<p><a href=\"\">How to create content on Meta Space 如何在 Meta Space 上创建内容</a><a href=\"\">How to create an article 如何创建文章</a><a href=\"\">通过 CMS 系统创建文章 Creating an article through the CMS system</a><a href=\"\">通过 Matataki 同步文章  Syncing articles via Matataki</a><a href=\"\">如何发布我的文章 How to publish my articles</a><a href=\"\">提交内容 Submitting content</a><a href=\"\">发布内容 Publishing content</a><a href=\"\">草稿箱 Drafting Box</a></p>\n<h2 id=\"How-to-create-an-article-如何创建文章\">How to create an article 如何创建文章</h2>\n<p><strong>您可以通过以下两种方式创建出新的文章：</strong><br>\n<strong>You can create a new article in two ways：</strong></p>\n<ol>\n<li>**通过 Meta Space Console 系统直接创建文章 Directly through the Meta Space Console **</li>\n<li><strong>通过 Matataki 账号同步文章 Synchronize articles through your Matataki account</strong></li>\n</ol>\n<h3 id=\"通过-CMS-系统创建文章-Creating-an-article-through-the-CMS-system\">通过 CMS 系统创建文章 Creating an article through the CMS system</h3>\n<p><strong>在 Meta Space Console 中的侧边栏，找到并点击 “创作”按钮即可开始进入编辑页面。</strong><br>\n<strong>In the sidebar of Meta Space Console, find and click on the “Create” button to start the editing page.</strong><br>\n<strong>Meta Space Console 采用了 Markdown 编辑器，当然您依然可以使用我们在编辑器工具栏中提供的快捷按钮来实现内容的排版。顺带一提，编辑器支持 3 种模式的显示，通过工具栏的按钮切换：</strong><br>\n<strong>Meta Space Console uses a Markdown editor, but of course, you can still use the shortcut buttons we provide in the editor toolbar to typeset the content. Incidentally, the editor supports three modes of display, which are toggled via the toolbar buttons.</strong></p>\n<ul>\n<li><strong>所见即所得 WYSIWYG</strong></li>\n<li><strong>即时渲染 Even rendering</strong></li>\n<li><strong>分屏预览 Split-screen preview</strong></li>\n</ul>\n<p><strong>如果您在前两种模式的编辑状态下发现了编辑困难的情况，请点击工具栏中的切换按钮，将编辑模式切换为 “分屏预览” 模式，已实现对 Markdown 源码的编辑。</strong><br>\n<strong>If you find it difficult to edit in the first two modes of editing, please click the toggle button in the toolbar to switch the editing mode to “Split Screen Preview” mode, which has been implemented for editing Markdown source code.</strong></p>\n<h3 id=\"通过-Matataki-同步文章-Syncing-articles-via-Matataki\">通过 Matataki 同步文章  Syncing articles via Matataki</h3>\n<p><strong>如果您曾经作为 Matataki 的用户发布过文章，您可以通过以下操作方法将文章同步到 CMS 中</strong><br>\n<strong>If you have published an article as a Matataki user, you can synchronize it to CMS by the following actions</strong></p>\n<ol>\n<li>**在 Meta Space Console 的菜单中选择 管理 -&gt; 内容源 ，进入内容源绑定页面 **<br>\n<strong>select Manage -&gt; Content Sources in the Meta Space Console menu to enter the content source binding page</strong></li>\n<li><strong>根据页面的引导绑定您的 Matatkai 账号并返回到该页面</strong><br>\n<strong>Follow the instructions on the page to bind your Matatkai account and return to the page</strong></li>\n<li><strong>进入 内容 -&gt; 同步中心 ，点击界面中的 “立即同步”（Sync now）按钮并等待同步完成</strong><br>\n<strong>Go to Content -&gt; Sync Center, click on the “Sync now” button in the interface, and wait for the sync to complete</strong></li>\n<li><strong>完成同步之后您会在当前页面中看到同步来的文章列表，选择任意一篇点击编辑按钮即可开始编辑</strong><br>\n<strong>After syncing, you will see the list of synced articles on the current page, select an article and click the edit button to start editing.</strong></li>\n</ol>\n<h2 id=\"如何发布我的文章-How-to-publish-my-articles\">如何发布我的文章 How to publish my articles</h2>\n<p><strong>Meta Space 是基于您的个人存储仓库和去中心化存储仓库来实现去平台化的 Meta space 发布功能，因此您需要遵循以下步骤来实现对创作内容的发布：</strong><br>\n<strong>Meta Space is based on your repository and decentralized repository for decentralized Meta Space publishing, so you need to follow these steps to publish your content.</strong></p>\n<ol>\n<li><strong>提交内容 到您的私有存储仓库，可以选择同时对创作内容进行去中心化存证</strong><br>\n<strong>Submit the content to your private repository, and optionally decentralize the content at the same time</strong></li>\n<li><strong>发布内容 到您的 Meta Space 公开存储仓库，可以同时选择去中心化全文存证</strong><br>\n<strong>Publish the content to your Meta Space public repository, with the option to decentralize full-text archiving</strong></li>\n</ol>\n<h3 id=\"提交内容-Submitting-content\">提交内容 Submitting content</h3>\n<p><strong>当您在 Meta Space Console 中的编辑起里完成了内容的编辑后，即可点击界面右上角的 “提交”（Sumbit）按钮进入提交功能。</strong><br>\n<strong>When you have finished editing your content in the Meta Space Console, you can click the “Submit” button in the upper right corner of the screen to enter the commit function.</strong></p>\n<ol>\n<li><strong>您的 Github 私密仓库是必选项，请核对仓库名称是否正确，如果不正确可能是您登陆了错误的账户。目前我们指定了使用 Github 作为您的个人仓库，因为相对于其它存储方式来说相对安全可控。未来我们将会提供开放的存储接口以及更多的非中心化存储渠道选择。</strong><br>\n**Your private Github repository is mandatory; please check if the repository name is correct; if it is not, you may be logged into the wrong account. Currently, we have specified Github as your repository because it is relatively safe and controlled compared to other storage methods. In the future, we will provide an open storage interface and more options for non-centralized storage channels. **</li>\n<li><strong>使用 IPFS 作为存证服务是可选项目，如果您担心发生中间人对您的内容攻击，建议勾选此项。使用该存证服务的时候 Meta Team 以及网关服务并不会获知您的正文内容，而只是会获得由您的签名加密过的正文摘要，通过该摘要可验证原作者关系但是无法还原出全文内容。</strong><br>\n<strong>Using IPFS as a repository service is optional and recommended if you are concerned about man-in-the-middle attacks on your content. Meta Team and the gateway service will not know the content of your text when you use this service but will only get a summary of the text encrypted by your signature, which can be used to verify the original authorship but not to restore the full content.</strong></li>\n<li><strong>完成上述设置之后点击 “提交”（sumbit）按钮即可开始提交内容。</strong><br>\n<strong>Click on the “submit” button after completing the above settings to submit the content.</strong></li>\n</ol>\n<p><strong>目前提交内容可能会花费较长的时间，因为我们采取了诸多的安全流程来保障您内容的安全提交。因此我们采取了 “异步发布” 流程，所以您可以一边在 Meta Space Console 中做别的事情，一边等待提交 内容完成的通知。我们将会在接下来的版本中优化提交内容的流程，以实现内容的快速提交。</strong><br>\n<strong>Submitting content may take a little longer at this time because we have adopted several security processes to ensure that your content is presented securely. Therefore, we have adopted an “asynchronous publishing” process, so you can do other things in the Meta Space Console while waiting for notification that your submission is complete. We’ll optimize the submission process in a future release to allow for faster content submission.</strong></p>\n<h3 id=\"发布内容-Publishing-content\">发布内容 Publishing content</h3>\n<p><strong>当您已经提交了 一篇 或是多篇 内容之后，您会发现并无法在自己的 Meta Space 中看到这些文章，这是因为文章目前还没有被发布到您专属的 Meta Space 存储仓库中。在没有完成最后的发布之前，您依然可以随时修改文章再次提交新的版本。请放心，您的内容一直都会被我们妥善处理的。</strong><br>\n<strong>After submitting one or more articles, you may not see them in your Meta Space because they have not yet been published to your own Meta Space repository. You can still edit your article and submit a new version at any time until the final release is complete. Please rest assured that your content will always be handled properly.</strong></p>\n<p><strong>这时候您应该发现了：当您完成了内容提交之后，会在 Meta Space Console 的最下方弹出 “发布我的 Meta Space”（Publish my Meta Space）按钮，点击之后进入 Meta Space 的发布公告能</strong><br>\n<strong>You should have noticed by now that when you finish submitting your content, the “Publish my Meta Space” button will pop up at the bottom of the Meta Space Console, and you will be able to click on it to access the Meta Space release announcement.</strong></p>\n<ol>\n<li><strong>您的 Github 公开仓库是必选项，请核对仓库名称是否正确，如果不正确可能是您登陆了错误的账户。目前我们指定了使用 Github 作为您的最终发布仓库，因为相对于其它存储方式来说相对安全可控。未来我们将会提供开放的存储接口以及更多的非中心化存储渠道选择。</strong><br>\n**Your Github public repository is mandatory; please check if the repository name is correct; if it is not, you may be logged into the wrong account. For now, we have specified Github as your final release repository because it is relatively safe and controlled compared to other storage methods. We will provide open storage interfaces and more options for non-centralized storage channels in the future. **</li>\n<li><strong>使用 IPFS 作为备份存储服务是可选项目，如果您希望自己的文章正文完全存储在去中心化存储网络中，并且不希望删除该内容，那么建议勾选此项。同存证服务一样，提交的时候使用您的签名进行过标记加密，并且该元数据会作为整体元数据中的一个环节存在。</strong><br>\n**Using IPFS as a backup storage service is optional and recommended if you want your article body to be entirely stored in a decentralized storage network and do not want to delete the content. As with the certificate service, the submission will be encrypted with your signature over the token, and the metadata will exist as a part of the comprehensive metadata. **</li>\n<li><strong>完成上述的设置后点击 “发布”（Publish）按钮即可开始发布您所有的内容到您的 Meta Space 中。</strong><br>\n<strong>After completing the above settings, click the Publish button to publish all your content to your Meta Space.</strong></li>\n</ol>\n<p><strong>目前完成 Meta Space 的发布可能会需要较长时间，请耐心等待发布完成。我们将会在接下来的版本中着重优化 提交 和 发布 的实现流程，以实现更加高效的创作体验。</strong><br>\n<strong>At this time, it may take a little longer to complete the publishing of Meta Space, so please be patient until the publishing is complete. We will optimize the submission and publishing process in upcoming releases to make the authoring experience more efficient.</strong></p>\n<h2 id=\"草稿箱-Drafting-Box\">草稿箱 Drafting Box</h2>\n<p><strong>好文章非一日之功</strong><br>\n<strong>Good writing doesn’t happen in a day</strong></p>\n<p><strong>当您写到一半的时候希望休息了，您可以放心的在编辑器中点击退出按钮，因为 Meta Space Console 已经实时在您的本地中对文章内容进行保存了。在您编辑的过程中，Meta Team 也无法接触到您的宝贵创作资产。</strong><br>\n<strong>When you’re halfway through writing and want to take a break, you can safely click the exit button in the editor because the Meta Space Console is already saving the article locally in real-time. Meta Team also has no access to your valuable creative assets while editing.</strong></p>\n<p><strong>您随时可以通过 内容 -&gt; 草稿 来访问您创建的草稿，点击 “编辑”（Edit）按钮即可立即回到上次创作的进度中。</strong><br>\n<strong>You can always access the draft you created by going to Content -&gt; Drafts and clicking the Edit button to return to the progress of your last creation immediately.</strong></p>\n<p><strong>祝创作愉快!</strong><br>\n<strong>Have a nice creating day!</strong></p>\n","raw":null,"categories":[],"tags":[]}]}